tutorials/interBRNSFoam/channelTransport/0/C_O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

// Saturated O2 in water
internalField   uniform 0.25;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.25;  // Saturated O2 (mol/m³)
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        // O2 exchange with air
        type            fixedValue;
        value           uniform 0.25;
    }

    bottom
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
