tutorials/interBRNSFoam/channelTransport/Allrun
#!/bin/bash
#------------------------------------------------------------------------------
# interBRNSFoam channelTransport tutorial - Allrun
#
# Two-phase channel flow with species transport (transport-only mode).
# No BRNS Fortran library required.
#------------------------------------------------------------------------------
cd "${0%/*}" || exit 1
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

# 1. Create mesh
runApplication blockMesh

# 2. Set initial water level (bottom 60% of channel)
runApplication setFields

# 3. Run solver
runApplication interBRNSFoam

#------------------------------------------------------------------------------
